# 张晓静的绝作
# 时间：2022/3/12 22:38
'''一、使用print方式进行输出（输出的目的地是文件）'''
fp=open('D://PYTHON//test.txt','w')
print('奋斗成就更好的你',file=fp)
fp.close()

'''第二种方式，使用文件读写操作'''
with open('D://PYTHON//test1.txt','w') as file:
    file.write('奋斗成就更好的你')


#输出北京的天气预报
print('星期日','今天')
print('---------------------------------------------')
print('08时','11时','14时','17时','20时','23时')
print('0°C ','6°C','10°C','4°C ','1°C ','0°C ')
print('---------------------------------------------')
print('明  天','3/13',' 2°C/11°C')
print('星期天','3/14',' 0°C/ 9°C')
print('星期一','3/15',' 4°C/19°C')
print('星期二','3/16','15°C/23°C')
print('星期三','3/17','20°C/32°C')


#机票购买界面
print('✈国内\t☪国际.港澳台\t↘发现低价')
print('------------------------------')
print('航班类型：⊙单程  ⊙往返  ⊙多程（含缺口城')
print('出发城市：北京')
print('到达城市：长春')
print('出发日期：2022/3/12')
print('返回日期；yyyy-MM-dd')
print('------------------------------')
print('\t\t□带儿童  □带婴儿')
print('\t\t\t_________')
print('\t\t\t|__搜索__|')


print('--------------------------------------------------------')

#地铁图
print('地铁1\t\t四惠东→苹果园')
print('\t\t首车:05:05')
print('\t\t末车:23:30\t\t票价：起步价：2元')
print('----------------------------------------------------------------------------------------------------------')
print('  1\t\t  3\t\t  5\t\t  7\t\t  9\t\t  11\t\t  12\t\t  14\t\t  16\t\t  18\t\t 20\t\t')
print('  ⇋\t\t  ⇋\t\t  ⇋\t\t  ⇋\t\t  ⇋\t\t  ⇋\t\t\t  ⇋\t\t\t  ⇋\t\t\t  ⇋\t\t\t  ⇋\t\t\t ⇋')
print('四惠东\t 大望路\t永安里\t 东单\t天安门东\t 西单\t\t复兴门\t\t木樨园\t\t公主坟\t\t五棵松\t\t八宝山\t')